read_verilog -formal counter.v
prep -top counter

opt_clean
setundef -zero
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang design.il
write_smt2  -wires -stbv design.smt2

